<?php

namespace Database\Seeders;

use App\Models\Blog;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class BlogSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $blog = new Blog();
        $blog->naslov = "Студенти РАФ-а представили стартап на GPAI";
        $blog->sadrzaj = "Студенти Рачунарског факултета Александар Спремо, Богдан Томић и Виктор Вујичић представили су свој стартап Tribal Camping на Самиту глобалног партнерства за вештачку интелигенцију (GPAI) који је одржан 3. и 4. децембра у Палати Србија. Организатори самита су Народна скупштина Републике Србије, Влада Републике Србије, Министарство науке, технолошког развоја и иновација, Канцеларија за ИТ и еУправу и програм Уједињених нација за развој.

        Овогодишњи GPAI самит је био посвећен унапређењу одговорног развоја вештачке интелигенције и начину коришћења за друштвене добробити. Догађају је присуствовало више од 500 најеминентнијих светских стручњака, а један од најистакнутијих учесника био је Јошуа Бенђио, најуспешнији канадски рачунарски научник, познат по револуционарном раду на вештачким неуронским мрежама. Делегати из држава чланица GPAI, међународних организација и водећих институција радили су заједно на идентификовању конкретних решења за подстицање вештачке интелигенције која је инклузивна, усмерена на људе и одржива.";
        $blog->save(); # sacuvamo podatke trenutnog bloga u bazu -> save()

        $blog = new Blog();
        $blog->naslov = "Одржана РАФ научна трибина";
        $blog->sadrzaj = "На Рачунарском факултету је одржана РАФ научна трибина у среду, 4. децембра. Ова конференција окупила је предаваче Рачунарског факултета, студенте докторских академских студија, као и предаваче изван Рачунарског факулетета који желе да остваре научну сарадњу. Тема окупљања били су актуелни научни радови предавача који су објављени и они који су у плану. Организатор РАФ научне трибине је продекан за науку проф. др Ђорђе Бабић, а координатор доцент др Марко Младеновић.

        Постоји висок потенцијал за научно-истраживачку сарадњу на РАФ-у и за то су неопходни континуитет и сарадња. Поред тога, треба унапредити координацију и рад са студентима докторских студија. Врло је висок значај оваквих скупова јер омогућавају да се утврде научне области у којима РАФ може да допринесе и тиме оствари већу међународну видљивост, тиме и пројекте, више докторских и мастер студената. Поред тога, нуди платформу на којој ће колектив моћи да се информише и координише ради унапређења квалитета и квантитета научне продукције, закључио је др Марко Младеновић.

        План је да се у наредном периоду сваког месеца одржи по једна РАФ научна трибина.";
        $blog->save();

        $blog = new Blog();
        $blog->naslov = "Пријаве за семинар за средњошколце RAF IT Days 2025 су у току!";
        $blog->sadrzaj = "Тестирање средњошколаца за петнаести IT семинар – RAF IT Days је почело и трајаће до 20. марта 2025. године. Семинар RAF IT Days 2025 одржаће се на Рачунарском факултету. Сви кандидати су у обавези да одраде ТЕСТ, а најуспешнији добијају позив да присуствују семинару. Семинар организује Рачунарски факултет са жељом да младима што више приближи информационе технологије, њихов напредак и примену у привреди.

        Ово је јединствена прилика да се ученици упознају са начином рада у IT индустрији и добију корисне информације и савете од искусних професионалаца. Компаније се радо одазивају позиву за дружење са средњошколцима, а то су до сада учиниле: Microsoft Development Center Serbia, Nordeus, Adobe, Google, Oracle, Godaddy, CET, Infostud и многе друге. Семинар ће трајати четири дана, а одржаће се од 4. до 7. априла 2025. године.

        За питања нам се обратите мејлом на: rafitdays [@] raf.rs";
        $blog->save();
    }
}
